app/controllers/browse_microsatellite_by_families_controller.rb

SELECT `families`.* FROM `families` WHERE (TRIM(lower(name)) LIKE 'a%')
---
  def index
    @alphabet = params[:browse_by_alphabet]
    if @alphabet != nil
      @Statistics = Statistic.get_statistics_by_families(@alphabet)
    else
      @Statistics = Statistic.all