app/controllers/browse_microsatellite_by_species_controller.rb

SELECT `species`.* FROM `species` WHERE (TRIM(lower(name)) LIKE 'a%')
SELECT `statistics`.* FROM `statistics` WHERE `statistics`.`species_id` = 1
---
  def index
    @alphabet = params[:browse_by_alphabet]
    if @alphabet != nil
      @Statistics = Statistic.get_statistics_by_species(@alphabet)
    else
      @Statistics = Statistic.all