app/controllers/browse_microsatellite_controller.rb

  def index
    @families = Family.all.order('name ASC')
    @species = Species.where(:family_id => @families.first.id).order('name ASC')
---
SELECT  `families`.* FROM `families`  ORDER BY name ASC LIMIT 1
SELECT `species`.* FROM `species` WHERE `species`.`family_id` = 20  ORDER BY name ASC