app/controllers/markers_list_controller.rb

SELECT  `species`.* FROM `species` WHERE `species`.`id` = 7 LIMIT 1
SELECT `ssrs`.* FROM `ssrs` WHERE (ssrs.species_id = 37 AND (TRIM(lower(annotations.Goterm)) LIKE '%GO:0006952%'))
---
  def index
    @species = params[:species_id]
    @ssr_types = nil
    if @species != nil
      @species_name = Species.find(@species).name
      if params[:ssr_type] != nil
        @ssr_types = params[:ssr_type].split(',')
      end
      @go_anno = params[:go_anno]
      @inter_pro_anno = params[:inter_pro_anno]
      @no_of_repeat = params[:no_of_repeat]
      @motif_size = params[:motif_size]
      @fdm_annotation = params[:fdm_annotation]
      @Ssr = Ssr.get_SSR_by_species(@species, @ssr_types, @no_of_repeat, @go_anno,
                                    @inter_pro_anno, @motif_size, @fdm_annotation)
    else
      @Ssr = Ssr.all

SELECT  `ssrs`.* FROM `ssrs` WHERE `ssrs`.`id` = 49 LIMIT 1
---
  def ajax_change_primer
    @primers = Ssr.find(params[:ssr_id])

SELECT  `annotations`.* FROM `annotations` WHERE `annotations`.`name` = 'PUT-167a-Actinidia_chinensis-1516'  ORDER BY `annotations`.`id` ASC LIMIT 1
---
  def ajax_change_annotation
    @anno_list = Array.new
    @anno = Annotation.where(:name => params[:ssr]).first