app/controllers/summary_report_controller.rb

SELECT  `statistics`.* FROM `statistics` WHERE `statistics`.`species_id` = 7  ORDER BY `statistics`.`id` ASC LIMIT 1
SELECT `ssrs`.* FROM `ssrs` WHERE `ssrs`.`species_id` = 7 AND `ssrs`.`SSR_type` = 'p1'
---
  def index
    @species = params[:species_id]
    if @species != nil
      @statistic = Statistic.where(:species_id => @species).first
      @stat_repeat_list = []
      stat = Ssr.where(:species_id => @species, :SSR_type => "p1").length