app/controllers/welcome_controller.rb

  def index
    @families = Family.all.order('name ASC')
    @species = Species.where(:family_id => @families.first.id).order('name ASC')
---
SELECT  `families`.* FROM `families`  ORDER BY name ASC LIMIT 1
SELECT `species`.* FROM `species` WHERE `species`.`family_id` = 20  ORDER BY name ASC

  def change_family
    @species = create_data_cbo(Species.where(:family_id => params[:family_id]).order('name ASC'), {:name=>"name",:id=>"id"})
---
SELECT `species`.* FROM `species` WHERE `species`.`family_id` = 3  ORDER BY name ASC